src/DataProcessors/ГрупповаяПечатьРеализаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ГрупповаяПечатьРеализаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаПринтер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭкземпляров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФормаИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФормаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ГрупповаяПечатьРеализаций/Ext/ObjectModule.bsl
Процедура ВыполнитьПечать() Экспорт
	
	Если ЕстьОшибкиНачальныхПараметров() Тогда
		Возврат;
	КонецЕсли;
	
	ФормыДляПечати = ПечатныеФормы.НайтиСтроки(Новый Структура("Выбрать", Истина));
	
	РезультатаЗапроса = РезультатЗапросаДокументов();
	
	Выборка = РезультатаЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Сообщить("Не найдено документов по выбранному контрагенту за указанный период!", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		НапечататьДокумент(Выборка.Ссылка, ФормыДляПечати);
	КонецЦикла;
	
КонецПроцедуры

Процедура НапечататьДокумент(Документ, ФормыДляПечати)
	
	ОбъектДокумента = Документ.ПолучитьОбъект();
	
	Для каждого СтрокаПечФормы Из ФормыДляПечати Цикл
		
		Если  СтрокаПечФормы.ПечатнаяФормаИмя = "УниверсальныйПередаточныйДокумент" Тогда
			СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(Документ, "СчетФактураВыданный", Истина);
			Если Не ЗначениеЗаполнено(СчетФактура) Тогда
				Сообщить("Для документа " + Документ + " не введен документ Счет-фактура выданный, печать УПД невозможна.", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ОбъектДокумента.Печать(СтрокаПечФормы.ПечатнаяФормаИмя, КоличествоЭкземпляров, НаПринтер);
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатЗапросаДокументов()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РеализацияТоваровУслуг.СтатусДокумента = &СтатусДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслуг.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ЗаполнитьСписокПечатныхФорм() Экспорт
	
	ПечатныеФормы.Очистить();
	
	ДобавитьВСписокПечФорму("УниверсальныйПередаточныйДокумент", 	"Универсальный передаточный документ (УПД)");
	//ДобавитьВСписокПечФорму("ТОРГ12", 								"ТОРГ-12 (Товарная накладная)");
	//ДобавитьВСписокПечФорму("СчетФактура", 							"Счет-фактура");
	ДобавитьВСписокПечФорму("СчетНаОплату", 						"Счет на оплату");
	ДобавитьВСписокПечФорму("ТоварныйЧек", 							"Товарный чек");
	
КонецПроцедуры

Процедура ДобавитьВСписокПечФорму(ПечатнаяФормаИмя, ПечатнаяФормаПредставление)
	
	НоваяСтрока = ПечатныеФормы.Добавить();
	НоваяСтрока.ПечатнаяФормаИмя 			= ПечатнаяФормаИмя;
	НоваяСтрока.ПечатнаяФормаПредставление 	= ПечатнаяФормаПредставление;
	
КонецПроцедуры

Функция ЕстьОшибкиНачальныхПараметров()
	
	ЕстьОшибки = Ложь;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Сообщить("Не выбран контрагент!");
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Сообщить("Не выбрано начало перииода!");
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		Сообщить("Не выбрано окончание периода!");
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если  ОкончаниеПериода < НачалоПериода Тогда
		Сообщить("Окончание периода раньше начала периода!");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции
